GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sdspi.c
    *data++ = STM32WB_SPI_READ_8(SPI);
    
    while (SPI->SR & (SPI_SR_FTLVL | SPI_SR_FRLVL | SPI_SR_BSY))
    {
    }

    crc16 = SPI->RXCRCR;

    SPI->CR1 = spi->cr1 | SPI_CR1_CRCEN | SPI_CR1_CRCL;
    SPI->CR1 = spi->cr1;
    SPI->CR1 = spi->cr1 | SPI_CR1_SPE;

    STM32WB_SPI_WRITE_8(SPI, tx_default);
    STM32WB_SPI_WRITE_8(SPI, tx_default);

    while (!(SPI->SR & SPI_SR_RXNE))
    {
    }

    crc16_data = STM32WB_SPI_READ_8(SPI) << 8;

    while (!(SPI->SR & SPI_SR_RXNE))
    {
    }

    crc16_data |= STM32WB_SPI_READ_8(SPI);
    
    return (crc16 ^ crc16_data);
}

#endif

#if 1

static inline __attribute__((optimize("O3"))) void stm32wb_sdspi_transmit_crc16(stm32wb_sdspi_t *sdspi, const uint8_t *data, uint32_t count)
{
    stm32wb_spi_t *spi = sdspi->spi;
    SPI_TypeDef *SPI = spi->SPI;
    uint16_t crc16;
    const uint8_t *data_e;
    
    data_e = data + count;

    SPI->CR1 = spi->cr1;
    SPI->CR1 = spi->cr1 | SPI_CR1_CRCEN | SPI_CR1_CRCL;
    SPI->CRCPR = 0x1021;
    SPI->CR1 = spi->cr1 | SPI_CR1_CRCEN | SPI_CR1_CRCL | SPI_CR1_SPE;
	
    STM32WB_SPI_WRITE_8(SPI, data[0]);
    STM32WB_SPI_WRITE_8(SPI, data[1]);
    STM32WB_SPI_WRITE_8(SPI, data[2]);
    STM32WB_SPI_WRITE_8(SPI, data[3]);
    data += 4;

    if (data != data_e)
    {
        do
        {
            while (!(SPI->SR & SPI_SR_RXNE))
            {
            }
            
            STM32WB_SPI_READ_8(SPI);
            STM32WB_SPI_WRITE_8(SPI, *data++);
        }
        while (data != data_e);
    }
    
    while (!(SPI->SR & SPI_SR_RXNE))
    {
    }
    
    STM32WB_SPI_READ_8(SPI);
    
    while (!(SPI->SR & SPI_SR_RXNE))
    {
    }
    
    STM32WB_SPI_READ_8(SPI);
    
    while (!(SPI->SR & SPI_SR_RXNE))
    {
    }
    
    STM32WB_SPI_READ_8(SPI);

    while (!(SPI->SR & SPI_SR_RXNE))
    {
    }
    
    STM32WB_SPI_READ_8(SPI);
    
    while (SPI->SR & (SPI_SR_FTLVL | SPI_SR_FRLVL | SPI_SR_BSY))
    {
    }

    crc16 = SPI->TXCRCR;

    SPI->CR1 = spi->cr1 | SPI_CR1_CRCEN | SPI_CR1_CRCL;
    SPI->CR1 = spi->cr1;
    SPI->CR1 = spi->cr1 | SPI_CR1_SPE;
    
    STM32WB_SPI_WRITE_8(SPI, crc16 >> 8);
    STM32WB_SPI_WRITE_8(SPI, crc16 >> 0);

    while (!(SPI->SR & SPI_SR_RXNE))
    {
    }
    
    STM32WB_SPI_READ_8(SPI);

    while (!(SPI->SR & SPI_SR_RXNE))
    {
    }
    
    STM32WB_SPI_READ_8(SPI);
}

#endif

static bool stm32wb_sdspi_detect(stm32wb_sdspi_t *sdspi)
{
    /* Remove this code for now. At the end of the day there are 3 usable
     * cases. One is with a external weak pulldown on CS, and the other
     * two are a external CD pin (either 0 or 1 as detect). So leave this
     * off for now till the rest of the bits and pieces are in place.
     */

#if 0
    bool detect;

    /* This below is kind of fragile. The idea is to first set CS to 0, wait a tad
     * till the input settles to a 0. The switch the mode to input, while will make
     * the external pullup on CS take effect. If internal PULLDOWN does not work,
     * it overpowers the external pullupon CS. The delays are required to let
     * the signal on CS settle.
     */

    stm32wb_gpio_pin_write(sdspi->pins.cs, 0);
    armv7m_core_udelay(250);
    stm32wb_gpio_pin_input(sdspi->pins.cs);
    armv7m_core_udelay(250);
    detect = !!stm32wb_gpio_pin_read(sdspi->pins.cs);
    stm32wb_gpio_pin_output(sdspi->pins.cs);
    stm32wb_gpio_pin_write(sdspi->pins.cs, 1);

    return detect;
#endif

    return true;
}

static void stm32wb_sdspi_select(stm32wb_sdspi_t *sdspi)
{
    stm32wb_spi_t *spi = sdspi->spi;

    SDSPI_STATISTICS_COUNT(sdcard_select);

    stm32wb_spi_acquire(spi, sdspi->clock, 0);

    /* CS output, drive CS to L */
    stm32wb_gpio_pin_write(sdspi->pins.cs, 0);

    /* The card will not drive DO for one more clock
     * after CS goes L, but will accept data right away.
     * The first thing after a select will be always
     * either a command (send_command), or a "Stop Token".
     * In both cases there will be a byte over the
     * bus, and hence DO will be stable.
     */
}

static void stm32wb_sdspi_unselect(stm32wb_sdspi_t *sdspi)
{
    stm32wb_spi_t *spi = sdspi->spi;

    SDSPI_STATISTICS_COUNT(sdcard_unselect);

    /* CS is output, drive CS to H */
    stm32wb_gpio_pin_write(sdspi->pins.cs, 1);

    /* The card drives the DO line at least one more
     * clock cycle after CS goes H. Hence send
     * one extra byte over the bus.
     */
    stm32wb_spi_data(spi, 0xff);

    stm32wb_spi_release(spi);
}

static void stm32wb_sdspi_mode(stm32wb_sdspi_t *sdspi, uint32_t mode)
{
    stm32wb_spi_t *spi = sdspi->spi;
    unsigned int n;

    stm32wb_gpio_pin_write(sdspi->pins.cs, 1);
    stm32wb_spi_release(spi);

    if (mode == STM32WB_SDSPI_MODE_NONE)
    {
        sdspi->clock = 0;
    }
    else
    {
        if (mode == STM32WB_SDSPI_MODE_IDENTIFY)
        {
            sdspi->clock = 400000;
        }
        else
        {
	    sdspi->clock = 25000000;
        }

        stm32wb_spi_acquire(spi, sdspi->clock, 0);

        if (mode == STM32WB_SDSPI_MODE_IDENTIFY)
        {
            stm32wb_gpio_pin_output(spi->pins.mosi);
            stm32wb_gpio_pin_write(spi->pins.mosi, 1);

            /* Here CS/MOSI are driven both to H.
             *
             * Specs says to issue 74 clock cycles in SPI mode while CS/MOSI are H,
             * so simply send 10 bytes over the clock line.
             */
    
            for (n = 0; n < 10; n++)
            {
                stm32wb_spi_data(sdspi->spi, 0xff);
            }
    
            stm32wb_gpio_pin_alternate(spi->pins.mosi);
        }

        stm32wb_gpio_pin_write(sdspi->pins.cs, 0);
    }
}

/*
 * stm32wb_sdspi_wait_ready(stm32wb_sdspi_t *sdspi, uint32_t timeout)
 *
 * Wait till DO transitions from BUSY (0x00) to READY (0xff).
 */

static int stm32wb_sdspi_wait_ready(stm32wb_sdspi_t *sdspi, uint32_t timeout)
{
    stm32wb_spi_t *spi = sdspi->spi;
    int status = F_NO_ERROR;
    uint32_t tstart, tend;
    uint8_t token;

    /* While waiting for non busy (not 0x00) the host can
     * release the CS line to let somebody else access the
     * bus. However there needs to be an extra clock
     * cycle after driving CS to H for the card to release DO,
     * as well as one extra clock cycle after driving CS to L
     * before the data is valid again.
     */

    tstart = armv7m_systick_micros();

    do
    {
        tend = armv7m_systick_micros();

        token = stm32wb_spi_data(spi, 0xff);

        if (token == SD_READY_TOKEN)
        {
            break;
        }

        if ((tend - tstart) > timeout)
        {
            status = F_ERR_ONDRIVE;
        }
    }
    while (status == F_NO_ERROR);

