GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sdspi.c
    return status;
}

static int stm32wb_sdspi_command(stm32wb_sdspi_t *sdspi, uint8_t index, uint32_t argument, uint32_t wait)
{
    stm32wb_spi_t *spi = sdspi->spi;
    int status = F_NO_ERROR;
    unsigned int n;
    uint8_t data[8], response;
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_COMMAND_RETRIES != 0)
    unsigned int retries = DOSFS_CONFIG_SDCARD_COMMAND_RETRIES +1;
#else /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_COMMAND_RETRIES != 0) */
    unsigned int retries = 0;
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_COMMAND_RETRIES != 0) */

    SDSPI_STATISTICS_COUNT(sdcard_command);

    /* A command needs at least one back to back idle cycle.
     */
    data[0] = 0xff;

    data[1] = 0x40 | index;
    data[2] = argument >> 24;
    data[3] = argument >> 16;
    data[4] = argument >> 8;
    data[5] = argument >> 0;

#if (DOSFS_CONFIG_SDCARD_CRC == 1)
    data[6] = (stm32wb_sdspi_compute_crc7(&data[1], 5) << 1) | 0x01;
#else /* (DOSFS_CONFIG_SDCARD_CRC == 1) */
    if (index == SD_CMD_GO_IDLE_STATE)
    {
	data[6] = 0x95;
    }
    else if (index == SD_CMD_SEND_IF_COND)
    {
        data[6] = 0x87;
    }
    else
    {
        data[6] = 0x01;
    }
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) */

    /* NCR is 1..8 bytes, so simply always discard the first byte,
     * and then read up to 8 bytes or till a vaild response
     * was seen. N.b that STOP_TRANSMISSION specifies that
     * the first byte on DataOut after reception of the command
     * is a stuffing byte that has to be ignored. The discard
     * takes care of that here.
     */

    data[7] = 0xff;

    do
    {
        if ((index == SD_CMD_STOP_TRANSMISSION) && (sdspi->state == STM32WB_SDSPI_STATE_READ_MULTIPLE))
        {
            stm32wb_spi_data_transmit(spi, &data[1], 7);
        }
        else
        {
            stm32wb_spi_data_transmit(spi, &data[0], 8);
        }

        for (n = 0; n < 7; n++)
        {
            response = stm32wb_spi_data(spi, 0xff);
        
            if (!(response & 0x80))
            {
                /*
                 * A STOP_TRANSMISSION can be issued before the card
                 * had send a "Data Error Token" for that last block
                 * that we are not really intrested in. This could result
                 * in a "Parameter Error" if the next block is out of bounds.
                 * Due to the way CMD_STOP_TRANSMISSION gets send there is
                 * also the chance it gets an "Illegal Command" error ...
                 */
                if (index == SD_CMD_STOP_TRANSMISSION)
                {
                    response &= ~(SD_R1_ILLEGAL_COMMAND | SD_R1_PARAMETER_ERROR);
                }
                break;
            }
        }

        sdspi->response[0] = response;

        /* Always read the rest of the data to avoid synchronization
         * issues. Worst case the data read is random.
         */
	for (n = 1; n <= wait; n++)
	{
	    sdspi->response[n] = stm32wb_spi_data(spi, 0xff);
	}
	
        if (response & 0x88)
        {
            if (response & 0x80)
            {
                SDSPI_STATISTICS_COUNT(sdcard_command_timeout);

#if (DOSFS_CONFIG_STATISTICS == 1)
                sdspi->statistics.sdcard_command_timeout_2[index]++;
#endif
            }
            else
            {
                SDSPI_STATISTICS_COUNT(sdcard_command_crcfail);

#if (DOSFS_CONFIG_STATISTICS == 1)
                sdspi->statistics.sdcard_command_crcfail_2[index]++;
#endif
            }

#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_COMMAND_RETRIES != 0)
            if (retries > 1)
            {
                stm32wb_gpio_pin_write(sdspi->pins.cs, 1);
                stm32wb_gpio_pin_write(sdspi->pins.cs, 0);

                SDSPI_STATISTICS_COUNT(sdcard_command_retry);
                    
                retries--;
            }
            else
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_COMMAND_RETRIES != 0) */
            {
                status = F_ERR_ONDRIVE;

                retries = 0;
            }
        }
        else
        {
            if ((index != SD_CMD_STOP_TRANSMISSION) && (index != SD_CMD_SEND_STATUS))
            {
                if (response & SD_R1_ERROR_MASK)
                {
                    status = F_ERR_ONDRIVE;
                }
            }

            retries = 0;
        }
    }
    while (retries != 0);

    if (status != F_NO_ERROR)
    {
        SDSPI_STATISTICS_COUNT(sdcard_command_fail);

#if (DOSFS_CONFIG_STATISTICS == 1)
        sdspi->statistics.sdcard_command_fail_2[index]++;
#endif
    }

    return status;
}

static int stm32wb_sdspi_receive(stm32wb_sdspi_t *sdspi, uint32_t blksz, uint8_t *data, uint32_t count, uint32_t *p_count_return)
{
    stm32wb_spi_t *spi = sdspi->spi;
    int status = F_NO_ERROR;
    uint8_t token;
    uint16_t crc16;
    uint32_t total, tstart, tend;

    SDSPI_STATISTICS_COUNT(sdcard_receive);

    total = count;

    tstart = armv7m_systick_micros();

    do
    {
        /* If a "Start Block Token" (0xfe) zips by then
         * a data block will follow. Otherwise a "Data Error Token"
         * shows up:
         *
         * 0x01 Execution Error
         * 0x02 CC Error
         * 0x04 Card ECC failed
         * 0x08 Out of Range
         *
         * The maximum documented timeout is 100ms for SDHC.
         */

        tend = armv7m_systick_micros();

        token = stm32wb_spi_data(spi, 0xff);

        if (token == SD_START_READ_TOKEN)
        {
            crc16 = stm32wb_sdspi_receive_crc16(sdspi, data, blksz);
            
#if (DOSFS_CONFIG_SDCARD_CRC == 1)
            if (crc16 != 0)
            {
                SDSPI_STATISTICS_COUNT(sdcard_receive_crcfail);

                if (sdspi->state == STM32WB_SDSPI_STATE_READ_MULTIPLE)
                {
                    status = stm32wb_sdspi_read_stop(sdspi);
                }

                break;
            }
            else
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1)  */
            {
                if (blksz == 512)
                {
                    sdspi->address += 1;
                    sdspi->count += 1;
                }
                
                data  += blksz;
                total -= 1;

                tstart = armv7m_systick_micros();
            }
        }

        else if ((token & SD_DATA_ERROR_TOKEN_VALID_MASK) == SD_DATA_ERROR_TOKEN_VALID_DATA)
        {
            sdspi->state = STM32WB_SDSPI_STATE_READY;

            if (token & SD_DATA_ERROR_CARD_ECC_FAILED)
            {
                status = F_ERR_READ;
            }
            else
            {
                status = F_ERR_ONDRIVE;
            }
        }

        else
        {
            if ((tend - tstart) > SD_READ_TIMEOUT)
            {
                SDSPI_STATISTICS_COUNT(sdcard_receive_timeout);
                
                status = F_ERR_ONDRIVE;
            }
        }
    }
    while ((status == F_NO_ERROR) && total);
        
    if (status != F_NO_ERROR)
    {
        SDSPI_STATISTICS_COUNT(sdcard_receive_fail);
    }

