GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sdspi.c
    *p_count_return = (count - total);
    
    return status;
}

static int stm32wb_sdspi_transmit(stm32wb_sdspi_t *sdspi, uint8_t start, uint32_t blksz, const uint8_t *data, uint32_t count, uint32_t *p_count_return)
{
    stm32wb_spi_t *spi = sdspi->spi;
    int status = F_NO_ERROR;
    uint8_t token, response;
    uint32_t total, tstart, tend;

    SDSPI_STATISTICS_COUNT(sdcard_transmit);

    total = count;

    tstart = armv7m_systick_micros();

    do
    {
        tend = armv7m_systick_micros();

        token = stm32wb_spi_data(spi, 0xff);

        if (token == SD_READY_TOKEN)
        {
            stm32wb_spi_data(spi, start);
            stm32wb_sdspi_transmit_crc16(sdspi, data, blksz);

            /* At last read back the "Data Response Token":
             *
             * 0x05 No Error
             * 0x0b CRC Error
             * 0x0d Write Error
             */
            
            response = stm32wb_spi_data(spi, 0xff);

            if ((response & SD_DATA_RESPONSE_MASK) != SD_DATA_RESPONSE_ACCEPTED)
            {
                if (sdspi->state == STM32WB_SDSPI_STATE_WRITE_MULTIPLE)
                {
                    status = stm32wb_sdspi_command(sdspi, SD_CMD_STOP_TRANSMISSION, 0, 1);
                }
                
                if (status == F_NO_ERROR)
                {
                    sdspi->state = STM32WB_SDSPI_STATE_WRITE_STOP;
                    
                    if ((response & SD_DATA_RESPONSE_MASK) == SD_DATA_RESPONSE_CRC_ERROR)
                    {
                        SDSPI_STATISTICS_COUNT(sdcard_transmit_crcfail);

                        status = stm32wb_sdspi_wait_ready(sdspi, SD_WRITE_STOP_TIMEOUT);

                        if (status == F_NO_ERROR)
                        {
                            sdspi->state = STM32WB_SDSPI_STATE_READY;
                        }
                    }
                    else
                    {
                        status = stm32wb_sdspi_write_sync(sdspi);
                    }
                }

                break;
            }
            else
            {
                if (blksz == 512)
                {
                    sdspi->address += 1;
                    sdspi->count += 1;
                }
                
                data  += blksz;
                total -= 1;

                tstart = armv7m_systick_micros();
            }
        }
        else
        {
            if ((tend - tstart) > SD_WRITE_TIMEOUT)
            {
                SDSPI_STATISTICS_COUNT(sdcard_transmit_timeout);

                status = F_ERR_ONDRIVE;
            }
        }
    }
    while ((status == F_NO_ERROR) && total);

    if (status != F_NO_ERROR)
    {
        SDSPI_STATISTICS_COUNT(sdcard_transmit_fail);
    }

    *p_count_return = (count - total);
    
    return status;
}

static int stm32wb_sdspi_read_stop(stm32wb_sdspi_t *sdspi)
{
    int status = F_NO_ERROR;

    SDSPI_STATISTICS_COUNT(sdcard_read_stop);

    // stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PB8, 1);

    status = stm32wb_sdspi_command(sdspi, SD_CMD_STOP_TRANSMISSION, 0, 0);

    if (status == F_NO_ERROR)
    {
        sdspi->state = STM32WB_SDSPI_STATE_READY;
    }

    // stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PB8, 0);
    
    return status;
}

static int stm32wb_sdspi_write_stop(stm32wb_sdspi_t *sdspi)
{
    stm32wb_spi_t *spi = sdspi->spi;
    int status = F_NO_ERROR;

    SDSPI_STATISTICS_COUNT(sdcard_write_stop);

    // stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PB2, 1);
    
    /* There need to be 8 clocks before the "Stop Transfer Token",
     * and 8 clocks after it, before the card signals busy properly.
     * The 8 clocks before are covered by stm32wb_sdspi_wait_ready().
     */

    status = stm32wb_sdspi_wait_ready(sdspi, SD_WRITE_TIMEOUT);
    
    if (status == F_NO_ERROR)
    {
        stm32wb_spi_data(spi, SD_STOP_TRANSMISSION_TOKEN);
        stm32wb_spi_data(spi, 0xff);

        sdspi->state = STM32WB_SDSPI_STATE_WRITE_STOP;
    }

    // stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PB2, 0);

    return status;
}

static int stm32wb_sdspi_write_sync(stm32wb_sdspi_t *sdspi)
{
    int status = F_NO_ERROR;

    SDSPI_STATISTICS_COUNT(sdcard_write_sync);

    // stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PB3, 1);

    status = stm32wb_sdspi_wait_ready(sdspi, SD_WRITE_STOP_TIMEOUT);

    if (status == F_NO_ERROR)
    {
        sdspi->state = STM32WB_SDSPI_STATE_READY;

        status = stm32wb_sdspi_command(sdspi, SD_CMD_SEND_STATUS, 0, 1);
        
        if (status == F_NO_ERROR)
        {
            if ((sdspi->response[0] & SD_R1_ERROR_MASK) || (sdspi->response[1] & SD_R2_ERROR_MASK))
            {
                if (sdspi->response[1] & (SD_R2_WP_VIOLATION | SD_R2_WP_ERASE_SKIP | SD_R2_CARD_ECC_FAILED | SD_R2_CC_ERROR | SD_R2_ERROR))
                {
                    if (sdspi->response[1] & (SD_R2_WP_VIOLATION | SD_R2_WP_ERASE_SKIP))
                    {
                        status = F_ERR_WRITEPROTECT;
                    }
                    else
                    {
                        status = F_ERR_WRITE;
                    }
                }
            }
        }
    }

    if (status != F_NO_ERROR)
    {
        SDSPI_STATISTICS_COUNT(sdcard_write_sync_fail);
    }

    // stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PB3, 0);

    return status;
}

static int stm32wb_sdspi_idle(stm32wb_sdspi_t *sdspi, uint32_t *p_media)
{
    stm32wb_spi_t *spi = sdspi->spi;
    int status = F_NO_ERROR;
    uint32_t media;
    unsigned int n;

    SDSPI_STATISTICS_COUNT(sdcard_idle);

    media = DOSFS_MEDIA_NONE;
    
    stm32wb_sdspi_mode(sdspi, STM32WB_SDSPI_MODE_IDENTIFY);

    /* Apply an initial CMD_GO_IDLE_STATE, so that the card is out of
     * data read/write mode, and can properly respond.
     */

    stm32wb_sdspi_command(sdspi, SD_CMD_GO_IDLE_STATE, 0, 0);

    if (sdspi->response[0] != 0x01)
    {
        /* There could be 2 error scenarios. One is that the
         * CMD_GO_IDLE_STATE was send while the card was waiting
         * for the next "Start Block" / "Stop Transmission" token.
         * The card will answer that normally by signaling BUSY,
         * when means there would be a 0x00 response.
         * The other case is that there was a reset request while
         * being in the middle of a write transaction. As a result
         * the card will send back a stream of non-zero values
         * (READY or a "Data Response Token"), which can be handled
         * by simple flushing the transaction (CRC will take care of
         * rejecting the data ... without CRC the last write will be
         * garbage.
         *
         * Hence first drain a possible write command, and then
         * rety CMD_GO_IDLE_STATE after a dosfs_sdcard_wait_ready().
         * If the card is still in BUSY mode, then retry the
         * CMD_GO_IDLE_STATE again.
         */

        if (sdspi->response[0] != 0x00)
        {
            for (n = 0; n < 1024; n++)
            {
                stm32wb_spi_data(spi, 0xff);
            }

            stm32wb_sdspi_command(sdspi, SD_CMD_GO_IDLE_STATE, 0, 0);
        }

        stm32wb_sdspi_wait_ready(sdspi, SD_WRITE_STOP_TIMEOUT);
            
        stm32wb_sdspi_command(sdspi, SD_CMD_GO_IDLE_STATE, 0, 0);

        if (sdspi->response[0] == 0x00)
        {
            stm32wb_sdspi_wait_ready(sdspi, SD_WRITE_STOP_TIMEOUT);
            
            stm32wb_sdspi_command(sdspi, SD_CMD_GO_IDLE_STATE, 0, 0);
        }
    }

    if (sdspi->response[0] == 0x01)
    {
        stm32wb_sdspi_command(sdspi, SD_CMD_SEND_IF_COND, 0x000001aa, 4);

        if (sdspi->response[0] == 0x01)
        {
            if ((sdspi->response[1] == 0x00) &&
                (sdspi->response[2] == 0x00) &&
                (sdspi->response[3] == 0x01) &&
                (sdspi->response[4] == 0xaa))
            {
                media = DOSFS_MEDIA_SDHC;
            }
            else
            {
                status = F_ERR_INVALIDMEDIA;
            }
        }
        else
        {
            media = DOSFS_MEDIA_SDSC;
        }
    }

    if (status == F_NO_ERROR)
    {
        status = stm32wb_sdspi_command(sdspi, SD_CMD_READ_OCR, 0x00000000, 4);

        if (status == F_NO_ERROR)
        {
            sdspi->OCR = ((sdspi->response[1] << 24) |
                          (sdspi->response[2] << 16) |
                          (sdspi->response[3] <<  8) |
                          (sdspi->response[4] <<  0));
            
            if (!(sdspi->OCR & 0x00300000))
            {
                status = F_ERR_INVALIDMEDIA;
            }
        }
    }

    if ((p_media == NULL) || (status != F_NO_ERROR))
    {
        sdspi->state = STM32WB_SDSPI_STATE_INIT;

        stm32wb_sdspi_mode(sdspi, STM32WB_SDSPI_MODE_NONE);
    }
    
