GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sdspi.c
    if (p_media)
    {
        *p_media = media;
    }
    
    return status;
}

static uint32_t stm32wb_sdspi_au_size_table[16] = {
    0,
    32,      /* 16KB  */
    64,      /* 32KB  */
    128,     /* 64KB  */
    256,     /* 128KB */
    512,     /* 256KB */
    1024,    /* 512KB */
    2048,    /* 1MB   */
    4096,    /* 2MB   */
    8192,    /* 4MB   */
    16384,   /* 8MB   */
    24576,   /* 12MB  */
    32768,   /* 16MB  */
    49152,   /* 24MB  */
    65536,   /* 32MB  */
    131072,  /* 64MB  */
};

static int stm32wb_sdspi_reset(stm32wb_sdspi_t *sdspi, uint32_t media)
{
    int status = F_NO_ERROR;
    uint32_t micros, count;

    SDSPI_STATISTICS_COUNT(sdcard_reset);

    /* Send ACMD_SD_SEND_OP_COND, and wait till the initialization process is done. The SDCARD has
     * 1000ms to complete this initialization process.
     */

    micros = armv7m_systick_micros();
    
    do
    {
        status = stm32wb_sdspi_command(sdspi, SD_CMD_APP_CMD, 0, 0);
            
        if (status == F_NO_ERROR)
        {
            status = stm32wb_sdspi_command(sdspi, SD_ACMD_SD_SEND_OP_COND, ((media == DOSFS_MEDIA_SDHC) ? 0x40300000 : 0x00300000), 0);
                
            if (status == F_NO_ERROR)
            {
                if (!(sdspi->response[0] & SD_R1_IN_IDLE_STATE))
                {
                    break;
                }
                    
                if (((uint32_t)armv7m_systick_micros() - micros) > 1000000)
                {
                    status = F_ERR_ONDRIVE;
                }
            }
        }
    }
    while (status == F_NO_ERROR);

    if (status == F_NO_ERROR)
    {
        if (media == DOSFS_MEDIA_SDHC)
        {
            status = stm32wb_sdspi_command(sdspi, SD_CMD_READ_OCR, 0x00000000, 4);

            if (status == F_NO_ERROR)
            {
                sdspi->OCR = ((sdspi->response[1] << 24) |
                              (sdspi->response[2] << 16) |
                              (sdspi->response[3] <<  8) |
                              (sdspi->response[4] <<  0));
                
                if (sdspi->OCR & 0x40000000)
                {
                    media = DOSFS_MEDIA_SDHC;
                }
                else
                {
                    media = DOSFS_MEDIA_SDSC;
                }
            }
        }
    }

    /* If we got here without a hitch then it's time to enter transfer mode
     * and setup buswidth and speed.
     */

    if (status == F_NO_ERROR)
    {
	stm32wb_sdspi_mode(sdspi, STM32WB_SDSPI_MODE_DATA_TRANSFER);

#if (DOSFS_CONFIG_SDCARD_CRC == 1)
        if (status == F_NO_ERROR)
        {
            status  = stm32wb_sdspi_command(sdspi, SD_CMD_CRC_ON_OFF, 1, 0);
        }
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) */

        status = stm32wb_sdspi_command(sdspi, SD_CMD_SEND_CID, 0, 0);

        if (status == F_NO_ERROR)
        {
            status = stm32wb_sdspi_receive(sdspi, 16, &sdspi->CID[0], 1, &count);

            if ((status == F_NO_ERROR) && (count != 1))
            {
                status = F_ERR_READ;
            }
        }
        
        if (status == F_NO_ERROR)
        {
            status = stm32wb_sdspi_command(sdspi, SD_CMD_SEND_CSD, 0, 0);

            if (status == F_NO_ERROR)
            {
                status = stm32wb_sdspi_receive(sdspi, 16, &sdspi->CSD[0], 1, &count);

                if ((status == F_NO_ERROR) && (count != 1))
                {
                    status = F_ERR_READ;
                }
            }
        }

        if (status == F_NO_ERROR)
        {
            status = stm32wb_sdspi_command(sdspi, SD_CMD_APP_CMD, 0, 0);

            if (status == F_NO_ERROR)
            {
                status = stm32wb_sdspi_command(sdspi, SD_ACMD_SEND_SCR, 0, 0);

                if (status == F_NO_ERROR)
                {
                    status = stm32wb_sdspi_receive(sdspi, 8, &sdspi->SCR[0], 1, &count);

                    if ((status == F_NO_ERROR) && (count != 1))
                    {
                        status = F_ERR_READ;
                    }
                }
            }
        }
	
        if (status == F_NO_ERROR)
        {
            status = stm32wb_sdspi_command(sdspi, SD_CMD_APP_CMD, 0, 0);

            if (status == F_NO_ERROR)
            {
                status = stm32wb_sdspi_command(sdspi, SD_ACMD_SD_STATUS, 0, 1);

                if (status == F_NO_ERROR)
                {
                    status = stm32wb_sdspi_receive(sdspi, 64, &sdspi->SSR[0], 1, &count);

                    if ((status == F_NO_ERROR) && (count != 1))
                    {
                        status = F_ERR_READ;
                    }
                }
            }
        }
        
        if (status == F_NO_ERROR)
        {
            status = stm32wb_sdspi_command(sdspi, SD_CMD_SET_BLOCKLEN, 512, 0);
        }
    }

    if (status == F_NO_ERROR)
    {
        sdspi->state = STM32WB_SDSPI_STATE_READY;

        sdspi->media = media;
        sdspi->shift = 9;
        sdspi->au_size = 0;
        sdspi->erase_size = 0;
        sdspi->erase_timeout = 0;
        sdspi->erase_offset = 0;

        if (media == DOSFS_MEDIA_SDHC)
        {
            sdspi->shift = 0;
            sdspi->au_size = stm32wb_sdspi_au_size_table[stm32wb_sdspi_slice(sdspi->SSR, 512, 428, 4)];
            sdspi->erase_size = stm32wb_sdspi_slice(sdspi->SSR, 512, 408, 16);
            sdspi->erase_timeout = stm32wb_sdspi_slice(sdspi->SSR, 512, 402, 6) * 1000000;
            sdspi->erase_offset = stm32wb_sdspi_slice(sdspi->SSR, 512, 400, 2) * 10000000;

            if (!sdspi->au_size || !sdspi->erase_size || !sdspi->erase_timeout)
            {
                sdspi->erase_size = 0;
                sdspi->erase_timeout = 0;
                sdspi->erase_offset = 0;
            }
        }

        SDSPI_STATISTICS_COUNT(sdcard_select);
    }
    else
    {
        sdspi->state = STM32WB_SDSPI_STATE_INIT;
        
        stm32wb_sdspi_mode(sdspi, STM32WB_SDSPI_MODE_NONE);

        status = F_ERR_CARDREMOVED;
    }

