GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sdspi.c
    return status;
}

static int stm32wb_sdspi_lock(stm32wb_sdspi_t *sdspi, int state, uint32_t address)
{
    int status = F_NO_ERROR;
    uint32_t media;

#if defined(DOSFS_PORT_SDCARD_LOCK)
    status = DOSFS_PORT_SDCARD_LOCK();
    
    if (status == F_NO_ERROR)
#endif /* DOSFS_PORT_SDCARD_LOCK */
    {
        stm32wb_system_lock(STM32WB_SYSTEM_LOCK_SLEEP);

        if (sdspi->state == STM32WB_SDSPI_STATE_INIT)
        {
            if (stm32wb_sdspi_detect(sdspi))
            {
                sdspi->state = STM32WB_SDSPI_STATE_RESET;
            }
            else
            {
                status = F_ERR_CARDREMOVED;
            }
        }
        
        if (status == F_NO_ERROR)
        {
            if (sdspi->state == STM32WB_SDSPI_STATE_RESET)
            {
	        status = stm32wb_sdspi_idle(sdspi, &media);

                if (status == F_NO_ERROR)
                {
                    status = stm32wb_sdspi_reset(sdspi, media);
                }
                else
                {
                    status = F_ERR_CARDREMOVED;
                }
            }
            else
            {
                stm32wb_sdspi_select(sdspi);

                if (sdspi->state == STM32WB_SDSPI_STATE_READ_MULTIPLE)
                {
                    if ((state != STM32WB_SDSPI_STATE_READ_MULTIPLE) || (sdspi->address != address))
                    {
                        status = stm32wb_sdspi_read_stop(sdspi);
                    }
                }

                if (sdspi->state == STM32WB_SDSPI_STATE_WRITE_MULTIPLE)
                {
                    if ((state != STM32WB_SDSPI_STATE_WRITE_MULTIPLE) || (sdspi->address != address))
                    {
                        status = stm32wb_sdspi_write_stop(sdspi);
                    }
                }

                if (sdspi->state == STM32WB_SDSPI_STATE_WRITE_STOP)
                {
                    if (state != STM32WB_SDSPI_STATE_WRITE_STOP)
                    {
                        status = stm32wb_sdspi_write_sync(sdspi);
                    }
                }
            }
        }
    }
    
    if (status != F_NO_ERROR)
    {
        status = stm32wb_sdspi_unlock(sdspi, status);
    }

    return status;
}

static int stm32wb_sdspi_unlock(stm32wb_sdspi_t *sdspi, int status)
{
    if ((sdspi->state != STM32WB_SDSPI_STATE_INIT) && (sdspi->state != STM32WB_SDSPI_STATE_RESET))
    {
        stm32wb_sdspi_unselect(sdspi);
    }

    if (status == F_ERR_ONDRIVE)
    {
	if (stm32wb_sdspi_idle(sdspi, NULL) == F_NO_ERROR)
        {
            sdspi->state = STM32WB_SDSPI_STATE_INIT;
        }
        else
        {
            sdspi->state = STM32WB_SDSPI_STATE_RESET;

            status = F_ERR_CARDREMOVED;
        }
    }

    stm32wb_system_unlock(STM32WB_SYSTEM_LOCK_SLEEP);

#if defined(DOSFS_PORT_SDCARD_UNLOCK)
    DOSFS_PORT_SDCARD_UNLOCK();
#endif /* DOSFS_PORT_SDCARD_UNLOCK */

    return status;
}

static int stm32wb_sdspi_start(void *context, uint8_t *p_media, uint8_t *p_write_protected, uint32_t *p_block_count, uint32_t *p_au_size, uint32_t *p_serial)
{
    stm32wb_sdspi_t *sdspi = (stm32wb_sdspi_t*)context;
    int status = F_NO_ERROR;
    uint32_t c_size, c_size_mult, read_bl_len;

    if (sdspi->state < STM32WB_SDSPI_STATE_READY)
    {
        status = stm32wb_sdspi_lock(sdspi, STM32WB_SDSPI_STATE_READY, 0);

        status = stm32wb_sdspi_unlock(sdspi, status);
    }
    
    if (status == F_NO_ERROR)
    {
        *p_media = sdspi->media;
        *p_write_protected = false;

        /* PERM_WRITE_PROTECT.
         * TMP_WRITE_PROTECT
         */
        if (stm32wb_sdspi_slice(sdspi->CSD, 128, 12, 2))
        {
            *p_write_protected = true;
        }
        
        if ((sdspi->CSD[0] & 0xc0) == 0)
        {
            /* SDSC */
            
            read_bl_len = stm32wb_sdspi_slice(sdspi->CSD, 128, 80, 4);
            c_size = stm32wb_sdspi_slice(sdspi->CSD, 128, 62, 12);
            c_size_mult = stm32wb_sdspi_slice(sdspi->CSD, 128, 47, 3);
            
            *p_block_count = ((c_size + 1) << (c_size_mult + 2)) << (read_bl_len - 9);
        }
        else
        {
            /* SDHC */

            c_size = stm32wb_sdspi_slice(sdspi->CSD, 128, 48, 22);

            *p_block_count = (c_size + 1) << (19 - 9);
        }

        *p_au_size = sdspi->au_size;

        *p_serial = stm32wb_sdspi_slice(sdspi->CID, 128, 24, 32);
    }

    return status;
}

static int stm32wb_sdspi_stop(void *context, bool eject)
{
    stm32wb_sdspi_t *sdspi = (stm32wb_sdspi_t*)context;
    int status = F_NO_ERROR;

    if ((sdspi->state != STM32WB_SDSPI_STATE_INIT) && (sdspi->state != STM32WB_SDSPI_STATE_RESET))
    {
        status = stm32wb_sdspi_lock(sdspi, STM32WB_SDSPI_STATE_READY, 0);
        
        if (status == F_NO_ERROR)
        {
            status = stm32wb_sdspi_unlock(sdspi, status);

            stm32wb_sdspi_mode(sdspi, STM32WB_SDSPI_MODE_NONE);

            sdspi->state = STM32WB_SDSPI_STATE_INIT;
        }
    }

    return status;
}

static int stm32wb_sdspi_format(void *context, uint32_t size)
{
    return F_NO_ERROR;
}

static int stm32wb_sdspi_erase(void *context, uint32_t address, uint32_t length)
{
    stm32wb_sdspi_t *sdspi = (stm32wb_sdspi_t*)context;
    int status = F_NO_ERROR;
    uint32_t au_start, au_end, timeout;

    if (sdspi->erase_size)
    {
        au_start = address / sdspi->au_size;
        au_end   = ((address + length + (sdspi->au_size -1)) / sdspi->au_size);

        timeout = ((sdspi->erase_timeout * (au_end - au_start)) / sdspi->erase_size) + sdspi->erase_offset;

        if (timeout < 1000000)
        {
            timeout = 1000000;
        }

        if (address != (au_start * sdspi->au_size))
        {
            timeout += 250000;
        }

        if ((address + length) != (au_end * sdspi->au_size))
        {
            timeout += 250000;
        }
        
        status = stm32wb_sdspi_lock(sdspi, STM32WB_SDSPI_STATE_READY, 0);

        if (status == F_NO_ERROR)
        {
            status = stm32wb_sdspi_command(sdspi, SD_CMD_ERASE_WR_BLK_START_ADDR, (address << sdspi->shift), 0);
        
            if (status == F_NO_ERROR)
            {
                status = stm32wb_sdspi_command(sdspi, SD_CMD_ERASE_WR_BLK_END_ADDR, ((address + length -1) << sdspi->shift), 0);
        
                if (status == F_NO_ERROR)
                {
                    status = stm32wb_sdspi_command(sdspi, SD_CMD_ERASE, 0, 0);

                    if (status == F_NO_ERROR)
                    {
                        status = stm32wb_sdspi_wait_ready(sdspi, timeout);

                        if (status == F_NO_ERROR)
                        {
                            status = stm32wb_sdspi_command(sdspi, SD_CMD_SEND_STATUS, 0, 1);
                        
                            if (status == F_NO_ERROR)
                            {
                                if ((sdspi->response[0] & SD_R1_ERROR_MASK) || (sdspi->response[1] & SD_R2_ERROR_MASK))
                                {
                                    if (sdspi->response[1] & (SD_R2_WP_VIOLATION | SD_R2_WP_ERASE_SKIP | SD_R2_CARD_ECC_FAILED | SD_R2_CC_ERROR | SD_R2_ERROR))
                                    {
                                        if (sdspi->response[1] & (SD_R2_WP_VIOLATION | SD_R2_WP_ERASE_SKIP))
                                        {
                                            status = F_ERR_WRITEPROTECT;
                                        }
                                        else
                                        {
                                            status = F_ERR_INVALIDSECTOR;
                                        }
                                    }
                                    else
                                    {
                                        status = F_ERR_ONDRIVE;
                                    }
                                }
                                else
                                {
                                    SDSPI_STATISTICS_COUNT_N(sdcard_erase, length);
                                }
                            }
                        }
                        else
                        {
                            SDSPI_STATISTICS_COUNT(sdcard_erase_timeout);
                        }
                    }
                }
            }

            status = stm32wb_sdspi_unlock(sdspi, status);
        }
    }

