GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sdspi.c
    return status;
}

static int stm32wb_sdspi_discard(void *context, uint32_t address, uint32_t length)
{
    return F_NO_ERROR;
}

static int stm32wb_sdspi_read(void *context, uint32_t address, uint8_t *data, uint32_t length)
{
    stm32wb_sdspi_t *sdspi = (stm32wb_sdspi_t*)context;
    int status = F_NO_ERROR;
    uint32_t count;
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
    unsigned int retries = DOSFS_CONFIG_SDCARD_DATA_RETRIES;
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */

    // stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PB9, 1);

    status = stm32wb_sdspi_lock(sdspi, STM32WB_SDSPI_STATE_READ_MULTIPLE, address);

    if (status == F_NO_ERROR)
    {
        do
        {
            if (sdspi->state != STM32WB_SDSPI_STATE_READ_MULTIPLE)
            {
                status = stm32wb_sdspi_command(sdspi, SD_CMD_READ_MULTIPLE_BLOCK, (address << sdspi->shift), 1);

                if (status == F_NO_ERROR)
                {
                    sdspi->state = STM32WB_SDSPI_STATE_READ_MULTIPLE;
                    sdspi->address = address;
                    sdspi->count = 0;
                }
            }

            if (status == F_NO_ERROR)
            {
                status = stm32wb_sdspi_receive(sdspi, DOSFS_BLK_SIZE, data, length, &count);

                SDSPI_STATISTICS_COUNT_N(sdcard_read_multiple, count);
                    
                if (status == F_NO_ERROR)
                {
                    if (count != length)
                    {
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
                        data += (DOSFS_BLK_SIZE * count);
                            
                        address += count;
                        length -= count;
                            
                        if (count)
                        {
                            SDSPI_STATISTICS_COUNT(sdcard_receive_retry);
                                
                            retries = DOSFS_CONFIG_SDCARD_DATA_RETRIES;
                                
                            continue;
                        }
                        else
                        {
                            if (retries)
                            {
                                SDSPI_STATISTICS_COUNT(sdcard_receive_retry);
                                    
                                retries--;
                                    
                                continue;
                            }
                        }
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */
                            
                        SDSPI_STATISTICS_COUNT(sdcard_receive_fail);

                        status = F_ERR_READ;
                    }
                    else
                    {
                        length = 0;
                    }
                }
            }
        }
        while ((status == F_NO_ERROR) && length);
            
        status = stm32wb_sdspi_unlock(sdspi, status);
    }

    // stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PB9, 0);

    return status;
}

static int stm32wb_sdspi_write(void *context, uint32_t address, const uint8_t *data, uint32_t length, bool sync)
{
    stm32wb_sdspi_t *sdspi = (stm32wb_sdspi_t*)context;
    int status = F_NO_ERROR;
    uint32_t count;
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
    unsigned int retries = DOSFS_CONFIG_SDCARD_DATA_RETRIES;
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */

    // stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PB1, 1);
    
    if ((length == 1) && sync && ((sdspi->state != STM32WB_SDSPI_STATE_WRITE_MULTIPLE) || (sdspi->address != address)))
    {
        status = stm32wb_sdspi_lock(sdspi, STM32WB_SDSPI_STATE_READY, 0);

        if (status == F_NO_ERROR)
        {
            do
            {
                status = stm32wb_sdspi_command(sdspi, SD_CMD_WRITE_SINGLE_BLOCK, (address << sdspi->shift), 0);
            
                if (status == F_NO_ERROR)
                {
                    sdspi->address = address;
                    sdspi->count = 0;
                    
                    status = stm32wb_sdspi_transmit(sdspi, SD_START_WRITE_SINGLE_TOKEN, DOSFS_BLK_SIZE, data, 1, &count);
                
                    if (status == F_NO_ERROR)
                    {
                        sdspi->state = STM32WB_SDSPI_STATE_WRITE_STOP;

                        SDSPI_STATISTICS_COUNT_N(sdcard_write_single, count);
                        
                        if (count != length)
                        {
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
                            if (retries)
                            {
                                SDSPI_STATISTICS_COUNT(sdcard_transmit_retry);
                            
                                retries--;
                            
                                continue;
                            }
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */
                        
                            SDSPI_STATISTICS_COUNT(sdcard_transmit_fail);

                            status = F_ERR_WRITE;
                        }
                        else
                        {
                            length = 0;

                            status = stm32wb_sdspi_write_sync(sdspi);
                        }
                    }
                }
            }
            while ((status == F_NO_ERROR) && length);

            status = stm32wb_sdspi_unlock(sdspi, status);
        }
    }
    else
    {
        status = stm32wb_sdspi_lock(sdspi, STM32WB_SDSPI_STATE_WRITE_MULTIPLE, address);
	
        if (status == F_NO_ERROR)
        {
            do
            {
	        if (sdspi->state != STM32WB_SDSPI_STATE_WRITE_MULTIPLE)
                {
                    if (status == F_NO_ERROR)
		    {
			status = stm32wb_sdspi_command(sdspi, SD_CMD_WRITE_MULTIPLE_BLOCK, (address << sdspi->shift), 0);
                        
			if (status == F_NO_ERROR)
			{
			    sdspi->state = STM32WB_SDSPI_STATE_WRITE_MULTIPLE;
			    sdspi->address = address;
			    sdspi->count = 0;
			}
		    }
                }

                if (status == F_NO_ERROR)
                {
                    status = stm32wb_sdspi_transmit(sdspi, SD_START_WRITE_MULTIPLE_TOKEN, DOSFS_BLK_SIZE, data, length, &count);

                    if (status == F_NO_ERROR)
                    {
                        SDSPI_STATISTICS_COUNT_N(sdcard_write_multiple, count);
                        
                        if (length != count)
                        {
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
                            data += (DOSFS_BLK_SIZE * count);
                            
                            address += count;
                            length -= count;
                            
                            if (count)
                            {
                                SDSPI_STATISTICS_COUNT(sdcard_transmit_retry);
                                
