GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sdspi.c
                                retries = DOSFS_CONFIG_SDCARD_DATA_RETRIES;
                                
                                continue;
                            }
                            else
                            {
                                if (retries)
                                {
                                    SDSPI_STATISTICS_COUNT(sdcard_transmit_retry);
                                    
                                    retries--;
                                    
                                    continue;
                                }
                            }
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */
                                
                            SDSPI_STATISTICS_COUNT(sdcard_transmit_fail);

                            status = F_ERR_WRITE;
                        }
                        else
                        {
                            if (sync)
                            {
                                status = stm32wb_sdspi_write_stop(sdspi);
                                
                                if (status == F_NO_ERROR)
                                {
                                    status = stm32wb_sdspi_write_sync(sdspi);
                                }
                            }
                            
                            length = 0;
                        }
                    }
                }
            }
            while ((status == F_NO_ERROR) && length);
        
            status = stm32wb_sdspi_unlock(sdspi, status);
        }
    }

    // stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PB1, 0);
    
    return status;
}

static int stm32wb_sdspi_sync(void *context)
{
    stm32wb_sdspi_t *sdspi = (stm32wb_sdspi_t*)context;
    int status = F_NO_ERROR;

    if (sdspi->state >= STM32WB_SDSPI_STATE_READ_MULTIPLE)
    {
        status = stm32wb_sdspi_lock(sdspi, STM32WB_SDSPI_STATE_READY, 0);

        if (status == F_NO_ERROR)
        {
            status = stm32wb_sdspi_unlock(sdspi, status);
        }
    }

    return status;
}

static const dosfs_device_interface_t stm32wb_sdspi_interface = {
    stm32wb_sdspi_start,
    stm32wb_sdspi_stop,
    stm32wb_sdspi_format,
    stm32wb_sdspi_erase,
    stm32wb_sdspi_discard,
    stm32wb_sdspi_read,
    stm32wb_sdspi_write,
    stm32wb_sdspi_sync,
};

int stm32wb_sdspi_initialize(stm32wb_spi_t *spi, const stm32wb_sdspi_params_t *params)
{
    stm32wb_sdspi_t *sdspi = (stm32wb_sdspi_t*)&stm32wb_sdspi;
    int status = F_NO_ERROR;

    dosfs_device.lock = DOSFS_DEVICE_LOCK_INIT;
    dosfs_device.context = (void*)sdspi;
    dosfs_device.interface = &stm32wb_sdspi_interface;

    sdspi->option = 0;

    if (sdspi->state == STM32WB_SDSPI_STATE_NONE)
    {
        if (spi->state == STM32WB_SPI_STATE_NONE)
        {
            status = F_ERR_INITFUNC;
        }
        else
        {
            sdspi->spi = spi;
            sdspi->pins = params->pins;

	    stm32wb_gpio_pin_configure(sdspi->pins.cs, (STM32WB_GPIO_PARK_PULLUP | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_OUTPUT));
	    stm32wb_gpio_pin_write(sdspi->pins.cs, 1);

            stm32wb_spi_enable(spi); // bump up refcount

            /* Try GO_IDLE after a reset, as the SDCARD could be still
             * powered during the reset.
             */

            stm32wb_sdspi_idle(sdspi, NULL);
            
            sdspi->state = STM32WB_SDSPI_STATE_INIT;
        }
    }
    
    dosfs_device.lock = 0;

    // stm32wb_gpio_pin_configure(STM32WB_GPIO_PIN_PB9, (STM32WB_GPIO_PARK_PULLUP | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_OUTPUT));
    // stm32wb_gpio_pin_configure(STM32WB_GPIO_PIN_PB8, (STM32WB_GPIO_PARK_PULLUP | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_OUTPUT));
    // stm32wb_gpio_pin_configure(STM32WB_GPIO_PIN_PB1, (STM32WB_GPIO_PARK_PULLUP | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_OUTPUT));
    // stm32wb_gpio_pin_configure(STM32WB_GPIO_PIN_PB2, (STM32WB_GPIO_PARK_PULLUP | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_OUTPUT));
    // stm32wb_gpio_pin_configure(STM32WB_GPIO_PIN_PB3, (STM32WB_GPIO_PARK_PULLUP | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_OUTPUT));
    // stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PB9, 0);
    // stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PB8, 0);
    // stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PB1, 0);
    // stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PB2, 0);
    // stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PB3, 0);
    
    return status;
}
